; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-4-24)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city4)
	(fuel-level plane1 fl3)
	(at plane2 city1)
	(fuel-level plane2 fl5)
	(at plane3 city8)
	(fuel-level plane3 fl4)
	(at plane4 city5)
	(fuel-level plane4 fl0)
	(at person1 city13)
	(at person2 city0)
	(at person3 city15)
	(at person4 city6)
	(at person5 city6)
	(at person6 city11)
	(at person7 city2)
	(at person8 city0)
	(at person9 city6)
	(at person10 city5)
	(at person11 city10)
	(at person12 city11)
	(at person13 city3)
	(at person14 city5)
	(at person15 city7)
	(at person16 city7)
	(at person17 city6)
	(at person18 city11)
	(at person19 city6)
	(at person20 city5)
	(at person21 city11)
	(at person22 city4)
	(at person23 city5)
	(at person24 city8)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city4)
	(at plane3 city3)
	(at person1 city4)
	(at person2 city8)
	(at person3 city1)
	(at person4 city4)
	(at person6 city7)
	(at person7 city2)
	(at person8 city16)
	(at person9 city12)
	(at person10 city5)
	(at person11 city2)
	(at person12 city2)
	(at person13 city1)
	(at person14 city7)
	(at person15 city14)
	(at person16 city8)
	(at person17 city11)
	(at person18 city12)
	(at person19 city1)
	(at person20 city6)
	(at person21 city0)
	(at person22 city11)
	(at person23 city14)
	(at person24 city3)
	))

)

; plan
1. (refuel plane4 city5 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 3 of 25
2. (board person23 plane4 city5)
   deleted: (at person23 city5)
   added: (in person23 plane4)
   goals met: 3 of 25
3. (board person20 plane4 city5)
   deleted: (at person20 city5)
   added: (in person20 plane4)
   goals met: 3 of 25
4. (board person14 plane4 city5)
   deleted: (at person14 city5)
   added: (in person14 plane4)
   goals met: 3 of 25
5. (zoom plane3 city8 city0 fl4 fl3 fl2)
   deleted: (at plane3 city8) (fuel-level plane3 fl4)
   added: (at plane3 city0) (fuel-level plane3 fl2)
   goals met: 3 of 25
6. (board person8 plane3 city0)
   deleted: (at person8 city0)
   added: (in person8 plane3)
   goals met: 3 of 25
7. (board person2 plane3 city0)
   deleted: (at person2 city0)
   added: (in person2 plane3)
   goals met: 3 of 25
8. (board person22 plane1 city4)
   deleted: (at person22 city4)
   added: (in person22 plane1)
   goals met: 3 of 25
9. (zoom plane1 city4 city11 fl3 fl2 fl1)
   deleted: (at plane1 city4) (fuel-level plane1 fl3)
   added: (at plane1 city11) (fuel-level plane1 fl1)
   goals met: 2 of 25
10. (board person6 plane1 city11)
   deleted: (at person6 city11)
   added: (in person6 plane1)
   goals met: 2 of 25
11. (debark person22 plane1 city11)
   deleted: (in person22 plane1)
   added: (at person22 city11)
   goals met: 3 of 25
12. (board person21 plane1 city11)
   deleted: (at person21 city11)
   added: (in person21 plane1)
   goals met: 3 of 25
13. (board person18 plane1 city11)
   deleted: (at person18 city11)
   added: (in person18 plane1)
   goals met: 3 of 25
14. (board person12 plane1 city11)
   deleted: (at person12 city11)
   added: (in person12 plane1)
   goals met: 3 of 25
15. (fly plane4 city5 city14 fl1 fl0)
   deleted: (at plane4 city5) (fuel-level plane4 fl1)
   added: (at plane4 city14) (fuel-level plane4 fl0)
   goals met: 3 of 25
16. (refuel plane4 city14 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 3 of 25
17. (debark person23 plane4 city14)
   deleted: (in person23 plane4)
   added: (at person23 city14)
   goals met: 4 of 25
18. (fly plane4 city14 city6 fl1 fl0)
   deleted: (at plane4 city14) (fuel-level plane4 fl1)
   added: (at plane4 city6) (fuel-level plane4 fl0)
   goals met: 4 of 25
19. (refuel plane4 city6 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 4 of 25
20. (board person9 plane4 city6)
   deleted: (at person9 city6)
   added: (in person9 plane4)
   goals met: 4 of 25
21. (board person4 plane4 city6)
   deleted: (at person4 city6)
   added: (in person4 plane4)
   goals met: 4 of 25
22. (debark person20 plane4 city6)
   deleted: (in person20 plane4)
   added: (at person20 city6)
   goals met: 5 of 25
23. (board person19 plane4 city6)
   deleted: (at person19 city6)
   added: (in person19 plane4)
   goals met: 5 of 25
24. (board person17 plane4 city6)
   deleted: (at person17 city6)
   added: (in person17 plane4)
   goals met: 5 of 25
25. (zoom plane3 city0 city16 fl2 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl2)
   added: (at plane3 city16) (fuel-level plane3 fl0)
   goals met: 5 of 25
26. (refuel plane3 city16 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 5 of 25
27. (debark person8 plane3 city16)
   deleted: (in person8 plane3)
   added: (at person8 city16)
   goals met: 6 of 25
28. (fly plane3 city16 city3 fl1 fl0)
   deleted: (at plane3 city16) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 7 of 25
29. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 25
30. (board person13 plane3 city3)
   deleted: (at person13 city3)
   added: (in person13 plane3)
   goals met: 7 of 25
31. (fly plane3 city3 city1 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 6 of 25
32. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 6 of 25
33. (debark person13 plane3 city1)
   deleted: (in person13 plane3)
   added: (at person13 city1)
   goals met: 7 of 25
34. (fly plane3 city1 city8 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city8) (fuel-level plane3 fl0)
   goals met: 7 of 25
35. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 25
36. (board person24 plane3 city8)
   deleted: (at person24 city8)
   added: (in person24 plane3)
   goals met: 7 of 25
37. (debark person2 plane3 city8)
   deleted: (in person2 plane3)
   added: (at person2 city8)
   goals met: 8 of 25
38. (fly plane3 city8 city3 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 9 of 25
39. (debark person24 plane3 city3)
   deleted: (in person24 plane3)
   added: (at person24 city3)
   goals met: 10 of 25
40. (fly plane4 city6 city1 fl1 fl0)
   deleted: (at plane4 city6) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 10 of 25
41. (refuel plane4 city1 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 10 of 25
42. (debark person19 plane4 city1)
   deleted: (in person19 plane4)
   added: (at person19 city1)
   goals met: 11 of 25
43. (fly plane4 city1 city11 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl1)
   added: (at plane4 city11) (fuel-level plane4 fl0)
   goals met: 11 of 25
44. (refuel plane4 city11 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 11 of 25
45. (debark person17 plane4 city11)
   deleted: (in person17 plane4)
   added: (at person17 city11)
   goals met: 12 of 25
46. (fly plane4 city11 city12 fl1 fl0)
   deleted: (at plane4 city11) (fuel-level plane4 fl1)
   added: (at plane4 city12) (fuel-level plane4 fl0)
   goals met: 12 of 25
47. (refuel plane4 city12 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 12 of 25
48. (debark person9 plane4 city12)
   deleted: (in person9 plane4)
   added: (at person9 city12)
   goals met: 13 of 25
49. (fly plane4 city12 city4 fl1 fl0)
   deleted: (at plane4 city12) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 13 of 25
50. (refuel plane4 city4 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 13 of 25
51. (debark person4 plane4 city4)
   deleted: (in person4 plane4)
   added: (at person4 city4)
   goals met: 14 of 25
52. (fly plane4 city4 city7 fl1 fl0)
   deleted: (at plane4 city4) (fuel-level plane4 fl1)
   added: (at plane4 city7) (fuel-level plane4 fl0)
   goals met: 14 of 25
53. (board person16 plane4 city7)
   deleted: (at person16 city7)
   added: (in person16 plane4)
   goals met: 14 of 25
54. (refuel plane4 city7 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 14 of 25
55. (board person15 plane4 city7)
   deleted: (at person15 city7)
   added: (in person15 plane4)
   goals met: 14 of 25
56. (debark person14 plane4 city7)
   deleted: (in person14 plane4)
   added: (at person14 city7)
   goals met: 15 of 25
57. (fly plane4 city7 city14 fl1 fl0)
   deleted: (at plane4 city7) (fuel-level plane4 fl1)
   added: (at plane4 city14) (fuel-level plane4 fl0)
   goals met: 15 of 25
58. (refuel plane4 city14 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 15 of 25
59. (debark person15 plane4 city14)
   deleted: (in person15 plane4)
   added: (at person15 city14)
   goals met: 16 of 25
60. (fly plane4 city14 city8 fl1 fl0)
   deleted: (at plane4 city14) (fuel-level plane4 fl1)
   added: (at plane4 city8) (fuel-level plane4 fl0)
   goals met: 16 of 25
61. (debark person16 plane4 city8)
   deleted: (in person16 plane4)
   added: (at person16 city8)
   goals met: 17 of 25
62. (fly plane1 city11 city0 fl1 fl0)
   deleted: (at plane1 city11) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 17 of 25
63. (zoom plane2 city1 city10 fl5 fl4 fl3)
   deleted: (at plane2 city1) (fuel-level plane2 fl5)
   added: (at plane2 city10) (fuel-level plane2 fl3)
   goals met: 17 of 25
64. (board person11 plane2 city10)
   deleted: (at person11 city10)
   added: (in person11 plane2)
   goals met: 17 of 25
65. (zoom plane2 city10 city13 fl3 fl2 fl1)
   deleted: (at plane2 city10) (fuel-level plane2 fl3)
   added: (at plane2 city13) (fuel-level plane2 fl1)
   goals met: 17 of 25
66. (board person1 plane2 city13)
   deleted: (at person1 city13)
   added: (in person1 plane2)
   goals met: 17 of 25
67. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 17 of 25
68. (debark person21 plane1 city0)
   deleted: (in person21 plane1)
   added: (at person21 city0)
   goals met: 18 of 25
69. (fly plane2 city13 city2 fl1 fl0)
   deleted: (at plane2 city13) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 18 of 25
70. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 18 of 25
71. (debark person11 plane2 city2)
   deleted: (in person11 plane2)
   added: (at person11 city2)
   goals met: 19 of 25
72. (fly plane2 city2 city4 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 19 of 25
73. (debark person1 plane2 city4)
   deleted: (in person1 plane2)
   added: (at person1 city4)
   goals met: 20 of 25
74. (fly plane1 city0 city12 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city12) (fuel-level plane1 fl0)
   goals met: 20 of 25
75. (refuel plane4 city8 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 20 of 25
76. (refuel plane1 city12 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 20 of 25
77. (debark person18 plane1 city12)
   deleted: (in person18 plane1)
   added: (at person18 city12)
   goals met: 21 of 25
78. (fly plane1 city12 city2 fl1 fl0)
   deleted: (at plane1 city12) (fuel-level plane1 fl1)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 21 of 25
79. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 21 of 25
80. (debark person12 plane1 city2)
   deleted: (in person12 plane1)
   added: (at person12 city2)
   goals met: 22 of 25
81. (fly plane1 city2 city7 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city7) (fuel-level plane1 fl0)
   goals met: 22 of 25
82. (refuel plane1 city7 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 22 of 25
83. (debark person6 plane1 city7)
   deleted: (in person6 plane1)
   added: (at person6 city7)
   goals met: 23 of 25
84. (fly plane1 city7 city4 fl1 fl0)
   deleted: (at plane1 city7) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 24 of 25
85. (fly plane4 city8 city15 fl1 fl0)
   deleted: (at plane4 city8) (fuel-level plane4 fl1)
   added: (at plane4 city15) (fuel-level plane4 fl0)
   goals met: 24 of 25
86. (board person3 plane4 city15)
   deleted: (at person3 city15)
   added: (in person3 plane4)
   goals met: 24 of 25
87. (refuel plane4 city15 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 24 of 25
88. (fly plane4 city15 city1 fl1 fl0)
   deleted: (at plane4 city15) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 24 of 25
89. (debark person3 plane4 city1)
   deleted: (in person3 plane4)
   added: (at person3 city1)
   goals met: 25 of 25
